毛思扬/Week4/01-intent-classify/test/ab_results_regex.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient).....done


Server Software:        uvicorn
Server Hostname:        0.0.0.0
Server Port:            8000

Document Path:          /v1/text-cls/regex
Document Length:        121 bytes

Concurrency Level:      100
Time taken for tests:   0.048 seconds
Complete requests:      100
Failed requests:        18
   (Connect: 0, Receive: 0, Length: 18, Exceptions: 0)
Total transferred:      24674 bytes
Total body sent:        22500
HTML transferred:       12074 bytes
Requests per second:    2095.51 [#/sec] (mean)
Time per request:       47.721 [ms] (mean)
Time per request:       0.477 [ms] (mean, across all concurrent requests)
Transfer rate:          504.93 [Kbytes/sec] received
                        460.44 kb/s sent
                        965.37 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.4      1       2
Processing:     6   29   9.7     31      40
Waiting:        4   29   9.5     30      40
Total:          6   31   9.4     32      42

Percentage of the requests served within a certain time (ms)
  50%     32
  66%     38
  75%     39
  80%     40
  90%     41
  95%     41
  98%     42
  99%     42
 100%     42 (longest request)