毛思扬/Week4/01-intent-classify/test/ab_results_tfidf.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient).....done


Server Software:        uvicorn
Server Hostname:        0.0.0.0
Server Port:            8000

Document Path:          /v1/text-cls/tfidt
Document Length:        22 bytes

Concurrency Level:      100
Time taken for tests:   0.037 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Total transferred:      15400 bytes
Total body sent:        22500
HTML transferred:       2200 bytes
Requests per second:    2681.04 [#/sec] (mean)
Time per request:       37.299 [ms] (mean)
Time per request:       0.373 [ms] (mean, across all concurrent requests)
Transfer rate:          403.20 [Kbytes/sec] received
                        589.10 kb/s sent
                        992.30 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   0.3      2       2
Processing:     9   13   3.9     12      21
Waiting:        9   13   4.0     12      21
Total:         11   15   3.8     14      23

Percentage of the requests served within a certain time (ms)
  50%     14
  66%     16
  75%     18
  80%     19
  90%     21
  95%     22
  98%     22
  99%     23
 100%     23 (longest request)